## Pandas Basics 
## 23913-MDSC-106-Assignment-1

*`DataFrame`*

A DataFrame is a table. 

It contains an array of individual entries, each of which has a certain value. 

Each entry corresponds to a row (or record) and a column.

In [1]:
import pandas as pd # importing panda libraries

In [2]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 22],
    'City': ['New York', 'London', 'Paris']
}

pd.DataFrame(data)  # creating a data frame

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   22     Paris

In [3]:
pd.DataFrame({'Yes': [50,30], 'No': [30,50]})   # setting colunms names

   Yes  No
0   50  30
1   30  50

In [4]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 
              'Sue': ['Pretty good.', 'Bland.']},
             index=['Product A', 'Product B'])   # setting index for rows and colunms as well

                     Bob           Sue
Product A    I liked it.  Pretty good.
Product B  It was awful.        Bland.

*`Series`*

A Series, by contrast, is a sequence of data values. 

If a DataFrame is a table, a Series is a list. And in fact you can create one with nothing more than a list:

In [5]:
pd.Series([1, 2, 3, 4, 5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
pd.Series(['30', '35', '40'], index=['2015 Sales', '2016 Sales', '2017 Sales'], name='Product A')

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: object

*`Reading data files`*

In [8]:
from_csv= pd.read_csv('sample.csv')  #from local data frame
from_csv

   Product A  Product B  Product C
0         30         40         96
1         40         52         58
2         50         31         46

In [9]:
from_csv.head(1)

   Product A  Product B  Product C
0         30         40         96

In [10]:
from_csv.tail(1)

   Product A  Product B  Product C
2         50         31         46

In [11]:
from_csv.shape

(3, 3)

In [12]:
from_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Product A  3 non-null      int64
 1   Product B  3 non-null      int64
 2   Product C  3 non-null      int64
dtypes: int64(3)
memory usage: 200.0 bytes

In [13]:
from_csv.describe()

       Product A  Product B  Product C
count        3.0   3.000000   3.000000
mean        40.0  41.000000  66.666667
std         10.0  10.535654  26.102363
min         30.0  31.000000  46.000000
25%         35.0  35.500000  52.000000
50%         40.0  40.000000  58.000000
75%         45.0  46.000000  77.000000
max         50.0  52.000000  96.000000

In [14]:
from_csv['Product A']

0    30
1    40
2    50
Name: Product A, dtype: int64

In [15]:
from_csv.head()

   Product A  Product B  Product C
0         30         40         96
1         40         52         58
2         50         31         46

Diabetes data set

In [16]:
from sklearn import datasets as df


ds = df.load_diabetes(as_frame=True)

In [17]:
ds['data']

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6
0,0.038076,0.050680,0.061696,0.021872,-0.044223,-0.034821,-0.043401,-0.002592,0.019907,-0.017646
1,-0.001882,-0.044642,-0.051474,-0.026328,-0.008449,-0.019163,0.074412,-0.039493,-0.068332,-0.092204
2,0.085299,0.050680,0.044451,-0.005670,-0.045599,-0.034194,-0.032356,-0.002592,0.002861,-0.025930
3,-0.089063,-0.044642,-0.011595,-0.036656,0.012191,0.024991,-0.036038,0.034309,0.022688,-0.009362
4,0.005383,-0.044642,-0.036385,0.021872,0.003935,0.015596,0.008142,-0.002592,-0.031988,-0.046641
...,...,...,...,...,...,...,...,...,...,...
437,0.041708,0.050680,0.019662,0.059744,-0.005697,-0.002566,-0.028674,-0.002592,0.031193,0.007207
438,-0.005515,0.050680,-0.015906,-0.067642,0.049341,0.079165,-0.028674,0.034309,-0.018114,0.044485
439,0.041708,0.050680,-0.015906,0.017293,-0.037344,-0.013840,-0.024993,-0.011080,-0.046883,0.015491
440,-0.045472,-0.044642,0.039062,0.001215,0.016318,0.015283,-0.028674,0.026560,0.044529,-0.025930
441,-0.045472,-0.044642,-0.073030,-0.081413,0.083740,0.027809,0.173816,-0.039493,-0.004222,0.003064